# This is a sample Python script.

# Press Shift+F10 to execute it or replace it with your code.
# Press Double Shift to search everywhere for classes, files, tool windows, actions, and settings
# !/usr/bin/python

# -*- coding: utf-8 -*-
import wx
from wx import *

Ly = [1.2, 0.9, 0.6, 0.7, 1.2, 0.5, 0.9, 0.8, 0.7, 0.8, 1.5, 0.9, 1.6, 0.8, 0.8, 1.9, 1.2, 0.6, 0.8, 0.7, 0.5, 1.5, 0.6,
      1.6, 1.5, 0.7, 0.9,
      1.2, 0.6, 0.5, 1.4, 1.4, 0.9, 0.7, 0.7, 0.9, 1.2, 0.8, 0.7, 1.3, 0.5, 1.4, 0.5, 0.9, 1.7, 0.5, 0.7, 1.2, 0.8, 0.8,
      0.6, 1.9, 0.6, 0.8, 1.6, 1.0, 0.7]
Lm = [0.6, 0.7, 1.8, 0.9, 0.5, 1.6, 0.9, 1.5, 1.8, 0.8, 0.9, 0.5]
Ld = [0.5, 1.0, 0.8, 1.5, 1.6, 1.5, 0.8, 1.6, 0.8, 1.6, 0.9, 1.7, 0.8, 1.7, 1.0, 0.8, 0.9, 1.8, 0.5, 1.5,
      1.0, 0.9, 0.8, 0.9, 1.5, 1.8, 0.7, 0.8, 1.6, 0.6]
Lh = [1.6, 0.6, 0.7, 1.0, 0.9, 1.6, 1.0, 0.8, 0.8, 0.9, 0.6, 0.6]
Lm2 = ['零', '一', '二', '三', '四', '五', '六', '七', '八', '九']
Lk = ['短命非业谓大空，平生灾难事重重，凶祸频临陷逆境，终世困苦事不成。', '此命劳碌一生穷，每逢困难事重重，凶祸频临陷苦境，终身大事谋不成。', '此命推来骨肉轻，求谋做事事难成，妻儿兄弟实难靠，外出他乡做散人。',
      '此命推来福禄无，门庭困苦总难荣，六亲骨肉皆无靠，流浪他乡作老翁。', '此命推来祖业微，门庭营度似稀奇，六亲骨肉如冰炭，一世勤劳自把持。', '平生衣禄苦中求，独自营谋事不休，离祖出门宜早计，晚来衣禄自无休。',
      '一生作事少商量，难靠祖宗作主张，独马单枪空做去，早年晚岁总无长。', '一生行事似飘蓬，祖宗产业在梦中，若不过房改名姓，也当移徒二三通。', '初年运限未曾亨，纵有功名在后成，须过四旬才可立，移居改姓始为良。',
      '劳劳碌碌苦中求，东奔西走何日休，若使终身勤与俭，老来稍可免忧愁。', '忙忙碌碌苦中求，何日云开见日头，难得祖基家可立，中年衣食渐无忧。', '初年运蹇事难谋，渐有财源如水流，到得中年衣食旺，那时名利一齐收。',
      '早年作事事难成，百计徒劳枉费心，半世自如流水去，后来运到得黄金。', '此命福气果如何，僧道门中衣禄多，离祖出家方为妙，朝晚拜佛念弥陀。', '生平福量不周全，祖业根基觉少传，营事生涯宜守旧，时来衣食胜从前。',
      '不须劳碌过平生，独自成家福不轻，早有福星常照命，任君行去百般成。', '此命般般事不成、弟兄少力自孤行。虽然祖业须微有，来得明时去不明。', '一身骨肉最清高，早入簧门姓氏标。待到年将三十六，蓝衫脱去换红袍。',
      '此命终身运不通，劳劳作事尽皆空，苦心竭力成家计，到得那时在梦中。', '平生衣禄是绵长，件件心中自主张。前面风霜多受过，后来必定享安康。', '此命推来事不同，为人能干异凡庸，中年还有逍遥福，不比前时运未通。',
      '得宽怀处且宽怀，何用双眉皱不开，若使中年命运济，那时名利一齐来。', '为人心性最聪明，作事轩昂近贵人，衣禄一生天数定，不须劳碌过平生。', '万事由天莫苦求，须知福禄命里收，少壮名利难如意，晚景欣然更不忧。',
      '名利推来竟若何，前番辛苦后奔波。命中难养男与女，骨肉扶持也不多。', '东西南北尽皆通，出姓移居更觉隆，衣禄无亏天数定，中年晚景一般同。', '此命推为旺末年，妻荣子贵自怡然，平生原有滔滔福，财源滚滚似水流。',
      '初年运道未曾亨，若是蹉跎再不兴，兄弟六亲皆无靠，一身事业晚年成。', '此命推来福不轻，自成自立显门庭，从来富贵人钦敬，使婢差奴过一生。', '为利为名终日劳，中年福禄也多遭，老来是有财星照，不比前番目下高。',
      '一世荣华事事通，不须劳碌自亨通，弟兄叔侄皆如意，家业成时福禄宏。', '一世荣华事事能，不须劳思自然宁，宗族欣然心皆好，家业丰亨自称心。', '此格推为气量真，兴家发达在其中，一生福禄安排定，却是人间一富翁。',
      '此命推来厚且清，诗书满腹看功成，丰衣足食自然稳，正是人间有福人。', '走马扬鞭争利名，少年作事费筹论，一朝福禄源源至，富贵荣华显六亲。', '此格推来礼义通，一身福禄用无穷，甜酸苦辣皆尝过，滚滚财源稳且丰。',
      '福禄丰盈万事全，一身荣耀乐天年。名扬威震人争羡，此世逍遥宛似仙。', '平生福禄自然来，名利兼全福寿偕，雁塔题名为贵客，紫袍金带走金阶。', '细推此格妙且清，必定才高礼义通，甲第之中应有分，扬鞭走马显威荣。',
      '一朝金榜快题名，显祖荣宗立大功，衣禄定然原裕足，田园财帛更丰盈。', '不作朝中金榜客，定为世上大财翁，聪明天赋经书熟，名显高科自是荣。', '此命生来福不穷，读书必定显亲宗，紫衣金带为卿相，富贵荣华皆可同。',
      '命主为官福禄长，得来富贵实丰常，名题金塔传金榜，定中高科天下扬。', '此格威权不可当，紫袍金带坐高堂，荣华富贵谁能及，积玉堆金满储仓。',
      '细推此命福非轻，富贵荣华孰与争？定国安邦人极品，威声显赫震寰瀛。', '此格人间一福人，堆金积玉满堂春，从来富贵由天定，正笏垂绅谒圣君。', '此命生来福自宏，田园家业最高隆，平生衣禄盈丰足，一世荣华万事通。',
      '富贵由天莫苦求，万金家计不须谋，如今不比前翻事，祖业根基飞古留。', '君是人间衣禄星，一生富贵众人钦，纵然福禄由天定，安享荣华过一生。', '此命推来福禄宏，不须愁虑苦劳心，一生天定衣与禄，富贵荣华主一生。',
      '此命生成大不同，公侯卿相在其中。一生自有逍遥福，富贵荣华极品隆。', '此格世界罕有生，十代积善产此人。天上紫微来照命，统治万民乐太平。']


class MainWindow(wx.Frame):
    def __init__(opp, parent, id):
        wx.Frame.__init__(opp, parent, id, title='称骨算命.beta', pos=(100, 100), size=(450, 300))
        panel = wx.Panel(opp)
        # 文本部分
        opp.title = wx.StaticText(panel, label='称骨算命', pos=(225, 50), size=(100, 25))
        opp.text_year = wx.StaticText(panel, label='年', pos=(65, 110), size=(15, 15))
        opp.text_month = wx.StaticText(panel, label='月', pos=(150, 110), size=(15, 15))
        opp.text_day = wx.StaticText(panel, label='日', pos=(235, 110), size=(15, 15))
        opp.text_hour = wx.StaticText(panel, label='时', pos=(320, 110), size=(15, 15))
        # 创建输入框
        opp.time_year = wx.TextCtrl(panel, pos=(80, 125), size=(50, 20))
        opp.time_month = wx.TextCtrl(panel, pos=(165, 125), size=(50, 20))
        opp.time_day = wx.TextCtrl(panel, pos=(250, 125), size=(50, 20))
        opp.time_hour = wx.TextCtrl(panel, pos=(335, 125), size=(50, 20))
        # 创建按钮
        opp.bite_sure = wx.Button(panel, label='sure', pos=(135, 230), size=(40, 20))
        opp.bite_sure.Bind(wx.EVT_BUTTON, opp.onclicksubmit)
        opp.bite_quit = wx.Button(panel, label='quit', pos=(270, 230), size=(40, 20))

    def onclicksubmit(opp, self):
        # 触发事件函数
        year = opp.time_year.GetValue()
        month = opp.time_month.GetValue()
        day = opp.time_day.GetValue()
        hour = opp.time_hour.GetValue()
        try:
            # 将扬州炒饭从菜单中删除（只能输入数字）
            int(year)
            int(month)
            int(day)
            int(hour)
        except ValueError:
            wx.MessageBox('请输入正确的日期格式！')
        # 计算索引值
        a = (int(year) - 843) % 60
        b = int(month) - 1
        c = int(day) - 1
        if c > 30:
            # 防止有人误输公历
            wx.MessageBox('请输入农历！')
        else:
            mass = Ly[a] + Lm[b] + Ld[c] + Lh[round(int(hour) / 2)]

            k1 = int(mass)
            k2 = int((mass - k1) * 10)
            mess = Lk[int(mass * 10 - 21)]
            wx.MessageBox(message='您的结果为' + Lm2[k1] + '两' + Lm2[k2] + '钱' + '\n' + mess + '\n' + '仅供娱乐，切勿当真',
                          caption='计算结果')


app = wx.App()
frame = MainWindow(parent=None, id=-1)
frame.Show()
app.MainLoop()
